DROP DATABASE IF EXISTS Books;
CREATE DATABASE IF NOT EXISTS Books;

CREATE TABLE books_for_pc(
    N INT(9) NOT NULL PRIMARY KEY,
    Code INT(9) NOT NULL DEFAULT 0,
    Is_new BOOLEAN NOT NULL DEFAULT FALSE,
    Name VARCHAR(100) NOT NULL DEFAULT '',
    Price FLOAT(4,2) DEFAULT NULL,
    Publisher VARCHAR(100) NOT NULL DEFAULT '',
    Pages_count INT(4) NOT NULL DEFAULT 0,
    Format VARCHAR(11) DEFAULT NULL,
    Date_book DATE DEFAULT NULL,
    Tirage INT(7) NOT NULL DEFAULT 0,
 Theme VARCHAR(100) NOT NULL DEFAULT '',
    Category VARCHAR(100) NOT NULL DEFAULT ''
);
CREATE INDEX indx_name ON books_for_pc(Name);
INSERT INTO books_for_pc(N,Code,Is_new,Name,Price,Publisher,Pages_count,Format,Date_book,Tirage,Theme,Category) VALUES
(2, 5110, FALSE, 'Апаратні засоби  мультимедіа. Відеосистема РС', 15.51, 'Видавнича група BHV',
400, '70x100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники'),
(8, 4985, FALSE, 'Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид.',
18.90, 'Вильямс', 288, '70x100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники'),
(9, 5141, FALSE, 'Структури даних та алгоритми', 37.80, 'Вильямс', 384, '70x100/16', '2000-09-29',
5000, 'Використання ПК в цілому', 'Підручники'),
(20, 5127, TRUE, 'Автоматизація інженерно-графічних робіт', 11.58, 'Видавнича група
BHV', 256, '70x100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Підручники'),
(31, 5110, TRUE, 'Апаратні засоби мультимедіа. Відеосистема РС', 15.51, 'Видавнича група BHV', 400,
'70x100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(46, 5199, FALSE, 'Залізо IBM 2001', 30.07, 'МикроАрт', 368, '70x100/16', '2000-02-12',5000,
'Використання ПК в цілому', 'Апаратні засоби ПК'),
(50, 3851, TRUE, 'Захист інформації та безпека комп`ютерних систем', 26.00, 'DiaSoft', 480,
'84x108/16', NULL, 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(58, 3932, TRUE, 'Як перетворити персональний комп`ютер на вимірювальний комплекс', 7.65, 'ДМК',
144, '60x88/16', '1999-09-06', 5000, 'Використання ПК в цілому', 'Інші книги'),
(59, 4713, TRUE, 'Plug-ins. Додаткові програми для музичних програм', 11.41, 'ДМК', 144, '70x100/16',
'2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги'),
(175, 5217, FALSE, 'Windows МЕ. Найновіші версії програм', 16.57, 'Триумф', 320, '70x100/16',
'2000-08-25', 5000, 'Операційні системи', 'Windows 2000'),
(176, 4829, FALSE, 'Windows 2000 Professional крок за кроком з CD', 27.25, 'Эком', 320, '70x100/16',
'2000-04-28', 5000, 'Операційні системи', 'Windows 2000'),
(188, 5170, FALSE, 'Linux версії', 24.43, 'ДМК', 346, '70x100/16', '2000-09-29', 5000, 'Операційні системи',
'Linux'),
(191, 860, FALSE, 'Операційна система UNIX', 3.50, 'Видавнича група BHV', 395, '84x100/16', '1997-05-05',
5000, 'Операційні системи', 'Unix'),
(203, 44, FALSE, 'Відповіді на актуальні запитання щодо OS/2 Warp', 5.00, 'DiaSoft', 352, '60x84/16',
'1996-03-20', 5000, 'Операційні системи', 'Інші операційні системи'),
(206, 5176, FALSE, 'Windows Ме. Супутник користувача', 12.79, 'Видавнича група BHV', 306, NULL,
'2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи'),
(209, 5462, FALSE, 'Мова програмування С++. Лекції та вправи', 29.00, 'DiaSoft', 656, '84x108/16',
'2000-12-12', 5000, 'Програмування', 'С&C++'),
(210, 4982, FALSE, 'Мова програмування С. Лекції та вправи', 29.00, 'DiaSoft', 432, '84x108/16',
'2000-12-07', 5000, 'Програмування', 'С&C++'),
(220, 4687, FALSE,'Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів',
17.60, 'ДМК', 240, '70x100/16', '2000-03-02', 5000, 'Програмування', 'С&C++'),
(222, 235, FALSE, 'Інформаційні системи і структури даних', NULL, 'Києво-Могилянська академія', 418,
'60x90\16', NULL, 100, 'Використання ПК в цілому', 'SQL'),
(225, 8746, FALSE, 'Бази даних в інформаційних системах', NULL, 'Університет `Україна`', 418, '60x84/16',
'2018-07-25', 500, 'Програмування', 'Інші книги'),
(226, 2154, FALSE, 'Сервер на основі операційної системи FreeBSD 6.1', NULL, 'Університет `Україна`', 216,
'60x84/16', '2015-11-03', 500, 'Програмування', 'SQL'),
(245, 2662, FALSE, 'Організація баз даних та  знань', NULL, 'Вінниця: ВДТУ', 208, '60x90/16', '2001-10-10',
1000, 'Програмування', 'SQL'),
(247, 5641, TRUE, 'Організація баз даних та знань', NULL, 'Видавнича група BHV', 384, '70x100/16',
'2021-12-15', 5000, 'Програмування', 'SQL');

ALTER TABLE books_for_pc ADD Author VARCHAR(15);
ALTER TABLE books_for_pc MODIFY COLUMN Author VARCHAR(20);
ALTER TABLE books_for_pc DROP COLUMN Author;
CREATE UNIQUE INDEX title_idx on books_for_pc(Name desc);
ALTER TABLE books_for_pc DROP INDEX indx_name;